{
  "abkhazia": "Green and white horizontal stripes with a red canton bearing an open hand and stars.",
  "afghanistan": "Tricolor layout with a centered emblem variant in common state versions.",
  "aland": "Nordic cross with a red cross outlined in yellow over a blue field.",
  "albania": "Plain field with a centered double-headed eagle emblem.",
  "algeria": "Two vertical halves with a centered crescent-and-star symbol across the divide.",
  "american samoa": "Blue field with a white-edged triangle from the fly and a central eagle emblem.",
  "andorra": "Three vertical bands with a detailed central coat of arms.",
  "angola": "Two horizontal bands with a central half-gear, machete, and star emblem.",
  "anguilla": "Blue ensign with Union Jack canton and a shield emblem on the fly side.",
  "antarctica": "Blue field with a centered white map silhouette of Antarctica.",
  "antigua and barbuda": "Red side triangles with a central rising sun above black, blue, and white bands.",
  "argentina": "Three horizontal stripes with a centered sun emblem on the middle stripe.",
  "armenia": "Three equal horizontal stripes in a simple tricolor layout.",
  "aruba": "Light blue field with two yellow horizontal stripes and a red star near the canton.",
  "australia": "Field with the Union Jack in the canton and white stars on the fly side.",
  "austria": "Three equal horizontal stripes with a plain center stripe.",
  "azerbaijan": "Three horizontal stripes with a centered crescent and eight-point star.",
  "bahamas": "Horizontal stripes with a black triangle at the hoist.",
  "bahrain": "Split field with a serrated vertical divider and triangular points.",
  "bangladesh": "Solid field with an offset circle toward the hoist and no border.",
  "barbados": "Three vertical bands with a centered broken trident symbol.",
  "basque country": "Red field with a green saltire and a white upright cross.",
  "belarus": "Two horizontal stripes with an ornamental vertical pattern at the hoist.",
  "belgium": "Three equal vertical bands, no emblem.",
  "belize": "Blue field with thin horizontal edge bands and a detailed circular coat of arms.",
  "benin": "Vertical band at the hoist with two horizontal bands on the fly side.",
  "bermuda": "Red ensign with Union Jack canton and a shield emblem on the fly side.",
  "bhutan": "Diagonal split field with a central dragon spanning both halves.",
  "bolivia": "Three horizontal stripes with the national coat of arms centered.",
  "bosnia and herzegovina": "Blue field with a large triangle and a line of stars along one edge.",
  "botswana": "Horizontal field with a dark central stripe bordered by thin light stripes.",
  "brazil": "Green field with a yellow diamond containing a blue globe and stars.",
  "british antarctic territory": "White ensign style field with Union Jack canton and a territorial badge emblem.",
  "british virgin islands": "Blue ensign with Union Jack canton and a shield showing a saintly lamp emblem.",
  "brunei": "Diagonal white and black bands over a yellow field with a central emblem.",
  "bulgaria": "Three equal horizontal stripes with a simple tricolor layout.",
  "burkina faso": "Two horizontal stripes with a centered five-point star.",
  "burundi": "Diagonal white cross dividing four panels with three centered stars.",
  "cambodia": "Three horizontal bands with a temple silhouette centered on the middle band.",
  "cameroon": "Three vertical bands with a centered star in the middle band.",
  "canada": "Vertical band layout with a centered maple leaf symbol.",
  "canary islands": "Vertical white, blue, and yellow bands with a central coat of arms emblem.",
  "cape verde": "Blue field with horizontal bands and a ring of yellow stars near the hoist side.",
  "catalonia": "Yellow field with four red horizontal stripes and no central emblem.",
  "cayman islands": "Blue ensign with Union Jack canton and a territorial shield emblem.",
  "central african republic": "Horizontal blue, white, green, and yellow bands crossed by a vertical red band.",
  "chad": "Three equal vertical bands in blue, yellow, and red.",
  "chile": "Two horizontal sections with a blue canton containing a single star.",
  "china": "Red field with one large star and four smaller stars near the hoist.",
  "christmas island": "Diagonal blue and green field with a yellow disc, stars, and a bird silhouette.",
  "cocos keeling islands": "Green field with crescent, palm tree disc, and stars arranged on the fly side.",
  "colombia": "Three horizontal stripes with the top stripe larger than the two lower stripes.",
  "commonwealth": "Blue field with a radiating globe-like symbol made from curved golden segments.",
  "comoros": "Four horizontal bands with a green hoist triangle, crescent, and stars.",
  "cook islands": "Blue ensign with Union Jack canton and a ring of white stars on the fly side.",
  "costa rica": "Five horizontal stripes with a broad central stripe and emblem variant.",
  "cote divoire": "Three equal vertical bands in orange, white, and green.",
  "croatia": "Three horizontal stripes with a checkerboard shield and crown emblem centered.",
  "cuba": "Five horizontal stripes with a hoist triangle and a centered star.",
  "curacao": "Blue field with a yellow horizontal stripe and two white stars in the canton.",
  "cyprus": "White field with a central island silhouette and olive-branch emblem below.",
  "czech republic": "Two horizontal bands with a hoist-side triangle extending inward.",
  "democratic republic of the congo": "Blue field with a red diagonal band bordered in yellow and a yellow star.",
  "denmark": "Simple Nordic cross extending to edges, shifted toward the hoist.",
  "djibouti": "Light blue and green horizontal bands with a white hoist triangle and red star.",
  "dominica": "Green field with a tricolor cross and a central red disc emblem.",
  "dominican republic": "White cross dividing four quarters with a central coat of arms.",
  "east timor": "Red field with black and yellow hoist triangles and a white star.",
  "ecuador": "Three horizontal stripes with a larger top band and centered coat of arms.",
  "egypt": "Three horizontal stripes with a central eagle emblem.",
  "el salvador": "Three horizontal stripes with a central coat of arms.",
  "england": "White field with a red upright cross.",
  "equatorial guinea": "Green, white, and red horizontal bands with a blue hoist triangle and coat of arms.",
  "eritrea": "Red hoist triangle dividing green and blue fields with a wreath emblem.",
  "estonia": "Three equal horizontal stripes in a simple tricolor layout.",
  "ethiopia": "Three horizontal stripes with a centered disc and star emblem.",
  "european union": "Blue field with a centered circle of twelve yellow stars.",
  "falkland islands": "Blue ensign with Union Jack canton and a territorial shield emblem.",
  "faroes": "White field with a red Nordic cross outlined in blue.",
  "fiji": "Light blue ensign field with Union Jack canton and a shield emblem.",
  "finland": "Nordic cross on a plain field, shifted toward the hoist.",
  "france": "Three equal vertical bands: one at the hoist, one in the center, and one at the fly.",
  "french polynesia": "Red-white-red horizontal bands with a central circular canoe-and-sun emblem.",
  "french southern territories": "Blue field with French tricolor canton and a territorial emblem with stars.",
  "gabon": "Three equal horizontal bands in green, yellow, and blue.",
  "gambia": "Red, blue, and green horizontal bands separated by thin white bands.",
  "georgia": "White field with one large cross and four smaller crosses.",
  "germany": "Three equal horizontal stripes stacked from top to bottom.",
  "ghana": "Three horizontal stripes with a centered black star.",
  "gibraltar": "White over red horizontal bands with a castle-and-key emblem centered above the divide.",
  "gosquared": "Purple-toned field with a centered geometric square motif used as a brand symbol.",
  "greece": "Alternating horizontal stripes with a cross in the top-left canton.",
  "greenland": "White and red horizontal bands with an offset red-and-white disc near the hoist.",
  "grenada": "Bordered field with stars, triangular panels, and a nutmeg emblem near the hoist.",
  "guam": "Blue field with a red border and a central pointed seal emblem.",
  "guatemala": "Three vertical bands with a centered coat of arms.",
  "guernsey": "White field with a red upright cross and a smaller gold cross overlay.",
  "guinea": "Three equal vertical bands in red, yellow, and green.",
  "guinea bissau": "Red hoist band with a black star and yellow-green horizontal bands.",
  "guyana": "Green field with layered arrowhead triangles, borders, and contrasting color bands.",
  "haiti": "Blue and red horizontal bands with a centered coat of arms emblem.",
  "honduras": "Three horizontal stripes with five centered stars.",
  "hong kong": "Red field with a white five-petal flower emblem and small stars.",
  "hungary": "Three equal horizontal stripes in a simple tricolor layout.",
  "iceland": "Nordic cross with a bordered inner cross, shifted toward the hoist.",
  "india": "Three horizontal stripes with a centered wheel symbol.",
  "indonesia": "Two equal horizontal bands in a simple bicolor layout.",
  "iran": "Three horizontal stripes with a centered emblem and script-like border motifs.",
  "iraq": "Three horizontal stripes with Arabic script across the center.",
  "ireland": "Three equal vertical bands with no emblem.",
  "isle of man": "Red field with a centered three-legged triskelion emblem.",
  "israel": "White field with two horizontal stripes and a centered Star of David.",
  "italy": "Three equal vertical bands with a simple tricolor layout and no emblem.",
  "jamaica": "Diagonal cross dividing four triangles with no central emblem.",
  "japan": "Plain field with a single centered circle and no other symbols.",
  "jersey": "White field with a red diagonal cross and crowned shield in the upper area.",
  "jordan": "Three horizontal stripes with a hoist triangle containing a star.",
  "kazakhstan": "Field with a sun and eagle centered, plus ornamental pattern near the hoist.",
  "kenya": "Three horizontal stripes with white separators and a central shield with spears.",
  "kiribati": "Red upper field with a sun-and-bird emblem above blue-and-white wave bands.",
  "kosovo": "Blue field with a gold map silhouette beneath an arc of white stars.",
  "kuwait": "Three horizontal stripes with a black trapezoid at the hoist.",
  "kyrgyzstan": "Red field with a yellow sun and central yurt-roof emblem.",
  "laos": "Red-blue-red horizontal bands with a centered white disc.",
  "latvia": "Two dark horizontal bands separated by a narrower light middle band.",
  "lebanon": "Two horizontal edge bands with a centered cedar tree.",
  "lesotho": "Blue, white, and green horizontal bands with a black hat emblem.",
  "liberia": "Horizontal red-white stripes with a blue canton containing a white star.",
  "libya": "Red, black, and green horizontal bands with a crescent and star in the center band.",
  "liechtenstein": "Blue and red horizontal bands with a yellow crown emblem in the canton.",
  "lithuania": "Three equal horizontal stripes in a simple tricolor layout.",
  "luxembourg": "Three equal horizontal stripes in a simple tricolor layout.",
  "macau": "Green field with lotus-over-water emblem and an arc of stars above.",
  "macedonia": "Red field with a yellow sun and radiating rays.",
  "madagascar": "White vertical hoist band with red and green horizontal fly bands.",
  "malawi": "Black, red, and green horizontal bands with a rising sun emblem.",
  "malaysia": "Horizontal stripes with a canton containing a crescent and star.",
  "maldives": "Red field with a centered green rectangle and white crescent symbol.",
  "mali": "Three equal vertical bands in green, yellow, and red.",
  "malta": "White and red vertical bands with a small cross emblem in the canton.",
  "mars": "Deep red field variant with a minimal planetary emblem and geometric symbol styling.",
  "marshall islands": "Blue field with diagonal white and orange bands and a white starburst.",
  "martinique": "French tricolor style field with a regional emblem variant in local use.",
  "mauritania": "Green field with crescent and star plus thin red top and bottom bands.",
  "mauritius": "Four equal horizontal bands in red, blue, yellow, and green.",
  "mayotte": "White field with a centered coat of arms emblem and text elements.",
  "mexico": "Three vertical bands with a centered eagle-and-serpent coat of arms.",
  "micronesia": "Blue field with four white stars arranged around the center.",
  "moldova": "Blue, yellow, and red vertical bands with a central coat of arms emblem.",
  "monaco": "Red and white horizontal bands in a simple bicolor layout.",
  "mongolia": "Red-blue-red vertical bands with a yellow Soyombo emblem on the hoist band.",
  "montenegro": "Red field with a gold border and central coat of arms emblem.",
  "montserrat": "Blue ensign with Union Jack canton and a shield featuring a female figure emblem.",
  "morocco": "Plain field with a centered pentagram star.",
  "mozambique": "Horizontal color bands with a red hoist triangle and a central emblem over a star.",
  "myanmar": "Three horizontal stripes with a large centered star.",
  "nagorno karabakh": "Horizontal color bands with a white stepped zigzag pattern cut into the fly side.",
  "namibia": "Diagonal red band with white borders separating blue and green fields and a sun emblem.",
  "nato": "Dark blue field with a centered white compass rose emblem.",
  "nauru": "Blue field with a thin yellow horizontal band and a white star below it.",
  "nepal": "Unique double-pennant shape with sun and moon emblems.",
  "netherlands": "Three equal horizontal stripes in a simple tricolor layout.",
  "netherlands antilles": "White field crossed by red and blue bands with white stars at the center.",
  "new caledonia": "Blue, red, and green horizontal bands with a yellow disc and black totem emblem.",
  "new zealand": "Blue field with the Union Jack in canton and stars on the fly side.",
  "nicaragua": "Three horizontal stripes with a central triangular coat of arms.",
  "niger": "Orange, white, and green horizontal bands with an orange disc in the center band.",
  "nigeria": "Three vertical bands with a central stripe and no emblem.",
  "niue": "Yellow field with a Union Jack canton modified by blue stars.",
  "norfolk island": "Vertical green-white-green bands with a green pine tree centered on the white band.",
  "north korea": "Central horizontal band bordered by thin stripes and a hoist-side star in a disc.",
  "northern cyprus": "White field with red top and bottom bands plus a central crescent and star.",
  "northern mariana islands": "Blue field with a white star over a latte-stone emblem and wreath.",
  "norway": "Nordic cross with a bordered inner cross, shifted toward the hoist.",
  "olympics": "White field with five interlocking colored rings centered as the emblem.",
  "oman": "Vertical red hoist band with white, red, and green horizontal stripes and national emblem.",
  "pakistan": "Field with a hoist-side vertical stripe and crescent-star on the main panel.",
  "palau": "Blue field with an offset yellow disc near the hoist side.",
  "palestine": "Black, white, and green horizontal bands with a red triangle at the hoist.",
  "panama": "Quartered layout with two stars in opposite white quarters.",
  "papua new guinea": "Diagonal split field with stars and a bird-of-paradise emblem.",
  "paraguay": "Three horizontal stripes with centered seal emblems on each side variant.",
  "peru": "Three vertical bands with a centered coat of arms variant.",
  "philippines": "Horizontal bicolor with hoist triangle containing a sun and three stars.",
  "pitcairn islands": "Blue ensign with Union Jack canton and a territorial shield emblem.",
  "poland": "Two equal horizontal bands with no central emblem.",
  "portugal": "Vertical split with a national coat of arms over an armillary sphere.",
  "puerto rico": "Five red and white horizontal stripes with a blue hoist triangle and white star.",
  "qatar": "Maroon and white field split by a serrated vertical boundary with many points.",
  "red cross": "White field with a centered red upright cross emblem.",
  "republic of the congo": "Diagonal green, yellow, and red color bands across the field.",
  "reunion": "Tricolor-style field used with regional variants and emblem forms.",
  "romania": "Three equal vertical bands in a simple tricolor layout.",
  "russia": "Three equal horizontal stripes in a simple tricolor layout.",
  "rwanda": "Blue, yellow, and green horizontal bands with a sun emblem in the canton.",
  "saint barthelemy": "White field with a centered heraldic shield and crown-style emblem.",
  "saint helena": "Blue ensign with Union Jack canton and a shield emblem on the fly side.",
  "saint kitts and nevis": "Diagonal black band with yellow borders across green and red triangles with stars.",
  "saint lucia": "Blue field with layered black, white, and yellow triangular motifs centered.",
  "saint martin": "White field with a centered coat of arms emblem and simple framing.",
  "saint vincent and the grenadines": "Vertical blue, yellow, and green bands with three green diamonds in the center band.",
  "samoa": "Red field with a blue canton containing white stars.",
  "san marino": "White and light-blue horizontal bands with a central coat of arms emblem.",
  "sao tome and principe": "Green-yellow-green horizontal bands with a red hoist triangle and two stars.",
  "saudi arabia": "Plain field with Arabic script and a horizontal sword beneath.",
  "scotland": "Blue field with a white diagonal saltire cross.",
  "senegal": "Green, yellow, and red vertical bands with a central green star.",
  "serbia": "Tricolor with a crowned coat of arms offset toward the hoist.",
  "seychelles": "Five oblique color bands radiating from the lower hoist corner.",
  "sierra leone": "Three equal horizontal bands in green, white, and blue.",
  "singapore": "Two horizontal bands with a crescent and five stars in the upper hoist.",
  "sint maarten": "Red-white-blue horizontal areas with a hoist triangle containing a coat of arms.",
  "slovakia": "Three horizontal stripes with a double-cross shield emblem near the hoist.",
  "slovenia": "Three horizontal stripes with a shield emblem near the hoist.",
  "solomon islands": "Diagonal blue and green fields separated by a yellow band with white stars.",
  "somalia": "Blue field with a centered white five-point star.",
  "somaliland": "Green, white, and red horizontal bands with script on top and a star below.",
  "south africa": "Green Y-shape with bordered bands converging from the hoist.",
  "south georgia and the south sandwich islands": "Blue ensign with Union Jack canton and a territorial shield emblem.",
  "south korea": "White field with a centered taegeuk and four trigrams.",
  "south ossetia": "White, red, and yellow horizontal stripes in equal bands.",
  "south sudan": "Black, red, and green horizontal bands with separators and a blue hoist triangle with star.",
  "spain": "Three horizontal stripes with the middle stripe wider than the top and bottom.",
  "sri lanka": "Field with a lion holding a sword plus border and panel divisions.",
  "sudan": "Red, white, and black horizontal bands with a green hoist triangle.",
  "suriname": "Green-white-red-white-green horizontal bands with a centered yellow star.",
  "swaziland": "Blue, yellow, and red horizontal bands with a central shield-and-spears emblem.",
  "sweden": "Nordic cross extending to the edges, shifted toward the hoist.",
  "switzerland": "Square flag with a centered white cross.",
  "syria": "Red, white, and black horizontal bands with two green stars.",
  "taiwan": "Field with a canton containing a white sun symbol.",
  "tajikistan": "Red, white, and green horizontal bands with a crown and stars emblem.",
  "tanzania": "Diagonal black band with yellow borders separating green and blue fields.",
  "thailand": "Five horizontal stripes with a broad central stripe.",
  "togo": "Alternating green and yellow horizontal bands with a red canton and white star.",
  "tokelau": "Blue field with a yellow canoe and a cluster of white stars.",
  "tonga": "Red field with a white canton containing a red cross.",
  "trinidad and tobago": "Red field with a diagonal black band bordered by white bands.",
  "tunisia": "Field with a central disc containing a crescent and star.",
  "turkey": "Field with a crescent and star symbol.",
  "turkmenistan": "Green field with a patterned hoist stripe, crescent, and stars.",
  "turks and caicos islands": "Blue ensign with Union Jack canton and a shield containing island symbols.",
  "tuvalu": "Light blue field with Union Jack canton and a pattern of stars on the fly side.",
  "uganda": "Six horizontal bands with a central disc containing a crested-crane emblem.",
  "ukraine": "Two equal horizontal bands in blue-over-yellow layout.",
  "united arab emirates": "Vertical hoist band plus three horizontal stripes on the fly side.",
  "united kingdom": "Overlapping diagonal and horizontal crosses forming a combined cross pattern.",
  "united nations": "Light blue field with a white world map and olive-branch emblem.",
  "united states": "Thirteen horizontal stripes with a top-left canton containing stars.",
  "unknown": "Neutral field with a centered question-mark symbol and simple border accents.",
  "uruguay": "Horizontal stripes with a sun emblem in the canton.",
  "us virgin islands": "White field with a central eagle emblem carrying symbols and flanked by initials.",
  "uzbekistan": "Blue, white, and green horizontal bands with thin red separators plus crescent and stars.",
  "vanuatu": "Red and green horizontal bands with a black hoist triangle, yellow Y-band, and emblem.",
  "vatican city": "Vertical yellow and white bands with crossed keys and papal tiara emblem.",
  "venezuela": "Three horizontal stripes with an arc of stars and emblem variant.",
  "vietnam": "Field with a large centered five-point star.",
  "wales": "White and green horizontal bands with a large red dragon emblem.",
  "wallis and futuna": "Red field with a white cross motif inside a red square near the canton.",
  "western sahara": "Black, white, and green horizontal bands with a red hoist triangle and crescent-star emblem.",
  "yemen": "Three equal horizontal stripes in a simple tricolor layout.",
  "zambia": "Field with vertical stripes at the fly side and an eagle above.",
  "zimbabwe": "Seven horizontal stripes with a hoist triangle containing a bird and star."
}
